Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.test_bucket3 will be destroyed
  # (because aws_s3_bucket.test_bucket3 is not in configuration)
- resource "aws_s3_bucket" "test_bucket3" {
      - arn                         = "arn:aws:s3:::sdds-test-bucket-3-cicd-west-2" -> null
      - bucket                      = "sdds-test-bucket-3-cicd-west-2" -> null
      - bucket_domain_name          = "sdds-test-bucket-3-cicd-west-2.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "sdds-test-bucket-3-cicd-west-2.s3.eu-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3GKZC51ZF0DB4" -> null
      - id                          = "sdds-test-bucket-3-cicd-west-2" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "Development"
          - "Name"        = "test-bucket-2"
        } -> null
      - tags_all                    = {
          - "Environment" = "Development"
          - "Name"        = "test-bucket-2"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "df41649688d0d135a4793727f93a599a4103e9a544ecfdfe300fe49fd105a7cb" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_public_access_block.app3 will be destroyed
  # (because aws_s3_bucket_public_access_block.app3 is not in configuration)
- resource "aws_s3_bucket_public_access_block" "app3" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "sdds-test-bucket-3-cicd-west-2" -> null
      - id                      = "sdds-test-bucket-3-cicd-west-2" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.main will be created
+ resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.main will be created
+ resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # random_id.suffix will be created
+ resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://a62928a1bfa1:4141/lock?id=widgetface%252Fatlantis-terraforming%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 4 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```